In [1]:
import pandas as pd
df = pd.read_csv("student_Dataset.csv", encoding="latin1")
df.head()

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
0,Christina,Binger,44,Female,Norway,Private,72,Masters,158,59.0,55
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
2,Philip,Leo,25,Male,Uganda,Sognsvann,55,HighSchool,130,74.0,50
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,High School,120,NaN,44
4,Maria,Kedibone,23,Female,South Africa,Sognsvann,65,High School,122,91.0,80

In [2]:
df.shape

(77, 11)

In [3]:
print(df.columns)
print(df.info())

Index(['fNAME', 'lNAME', 'Age', 'gender', 'country', 'residence', 'entryEXAM',
       'prevEducation', 'studyHOURS', 'Python', 'DB'],
      dtype='str')
<class 'pandas.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   fNAME          77 non-null     str
 1   lNAME          77 non-null     str
 2   Age            77 non-null     int64
 3   gender         77 non-null     str
 4   country        77 non-null     str
 5   residence      77 non-null     str
 6   entryEXAM      77 non-null     int64
 7   prevEducation  77 non-null     str
 8   studyHOURS     77 non-null     int64
 9   Python         75 non-null     float64
 10  DB             77 non-null     int64
dtypes: float64(1), int64(4), str(6)
memory usage: 6.7 KB
None

In [4]:
df['gender'].value_counts()

gender
Female    41
Male      32
M          1
F          1
female     1
male       1
Name: count, dtype: int64

In [5]:
df['gender'] = df['gender'].replace({
    'M': 'Male',
    'male': 'Male',
    'F': 'Female',
    'female': 'Female'
})
df['gender'].value_counts()

gender
Female    43
Male      34
Name: count, dtype: int64

In [7]:
df.drop(columns=['fNAME', 'lNAME'], inplace=True)
df.columns

Index(['Age', 'gender', 'country', 'residence', 'entryEXAM', 'prevEducation',
       'studyHOURS', 'Python', 'DB'],
      dtype='str')

In [9]:
df['country'].value_counts()

country
Norway          47
Uganda           4
Kenya            3
Germany          3
Denmark          2
Netherlands      2
Italy            2
Spain            2
UK               2
Somali           2
Nigeria          2
France           2
Rsa              1
South Africa     1
Norge            1
norway           1
Name: count, dtype: int64

In [10]:
df['country'] = df['country'].replace({
    'norway' : 'Norway',
    'Norge' : 'Norway',
    'Rsa' : 'South Africa'
})

In [11]:
df['country'].value_counts()

country
Norway          49
Uganda           4
Kenya            3
Germany          3
South Africa     2
Denmark          2
Netherlands      2
Italy            2
Spain            2
UK               2
Somali           2
Nigeria          2
France           2
Name: count, dtype: int64

In [12]:
df['prevEducation'].value_counts()

prevEducation
Bachelors       24
High School     18
Masters         16
Diploma          9
Doctorate        5
HighSchool       1
Barrrchelors     1
diploma          1
DIPLOMA          1
Diplomaaa        1
Name: count, dtype: int64

In [13]:
df['prevEducation'] = df['prevEducation'].replace({
    'Barrrchelors': 'Bachelors',

    'HighSchool': 'High School',

    'Diplomaaa': 'Diploma',
    'DIPLOMA': 'Diploma',
    'diploma': 'Diploma',

})

In [14]:
df['prevEducation'].value_counts()

prevEducation
Bachelors      25
High School    19
Masters        16
Diploma        12
Doctorate       5
Name: count, dtype: int64

In [16]:
df.isnull().sum()

Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           2
DB               0
dtype: int64

In [19]:
from sklearn.impute import SimpleImputer

num_imputer = SimpleImputer(strategy='mean')
df['Python'] = num_imputer.fit_transform(df[['Python']])

In [20]:
df.isnull().sum()

Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           0
DB               0
dtype: int64

In [21]:
df.to_csv("student_Dataset_cleaned.csv", index=False)